//5.1.1 函数的基本结构
    //格式
        /*
            返回类型 函数名(形式参数表){
                变量定义；
                语句；
            }
        */
        //形式参数表：需要从外部读入的参数名
        //需要返回值时，return返回类型，函数结束
        //不需要返回值时，类型位置写void

    //默认参数
        //有声明时在声明中给出，无声明在定义中给出
        //缺省值放在列表最后
        //e.g.
            //void print(int value, int base=10);

//5.1.2 函数定义和声明的区别
    //形式
        //声明    类型，函数名，输入
        //定义    类型，函数名，输入，执行内容
    //功能
        //声明    告诉编译器，去寻找该函数的定义，而不是分配空间
        //定义    告诉计算机该函数要执行什么

